# Задача №5. Решение в группах
# Вагоны в электричке пронумерованы натуральными числами, начиная с 1 
# (при этом иногда вагоны нумеруются от "головы" поезда, а иногда - с хвоста;
# это зависит от того, в какую сторону едет электичка). В каждом вагоне написан его номер.
# Витя сел в i-й вагон от головы поезда и обнаружил, что его вагон имеет номер j. 
# Он хочет определить, сколько вагонов в электричке.
# Напишите программу, которая будет это делать или сообщать, что без дополнительной информации это сделать невозможно.
# Input: 3 4 (ввод на разных строках)
# Output: 6

i = 5
j = 3

if (i == j):
    print('Решения нет')
else:
    print(i+j-1)