# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх
# решкой, а некоторые – гербом. Определите минимальное число
# монеток, которые нужно перевернуть, чтобы все монетки были
# повернуты вверх одной и той же стороной. Выведите минимальное
# количество монет, которое нужно перевернуть.
# 5 -> 1 0 1 1 0
# 2

coins = [1, 0, 1, 1, 0]
print('Минимальное количество монет, которое нужно перевернуть:' , min(coins.count(1), coins.count(0)))

# coins = [1, 0, 1, 1, 0, 0, 0, 0]
# print(min(coins.count(1), coins.count(0))) ---> 3 