# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы
# расплачивались за проезд и получали билет с номером. Счастливым
# билетом называют такой билет с шестизначным номером, где сумма
# первых трех цифр равна сумме последних трех. Т.е. билет с номером
# 385916 – счастливый, т.к. 3+8+5=9+1+6. 
# Вам требуется написать программу, которая проверяет счастливость билета.
# 385916 -> yes
# 123456 -> no

ticket = int(input('Введите номер билета: '))


def happy_ticket(ticket):
     sum1 = 0
     sum2 = 0 
     if len(str(ticket)) == 6:
        sum1 = ticket // 100000 + ticket // 10000 % 10 + ticket // 1000 % 10
        sum2 = ticket // 100 % 10 + ticket // 10 % 10 + ticket % 10
        if sum1 == sum2:
              print('Да, это счастливый билет!')
        elif sum1 != sum2:
              print('Нет, это обычный билет. Но счастье все равно есть! :)') 

def wrong_number(ticket):
     if len(str(ticket)) != 6:
          print('Нужен шестизначный номер')


wrong_number(ticket)
happy_ticket(ticket)

 
