#Задача 26: Напишите программу, которая на вход принимает
#два числа А и В, и возводит число А в целую степень В
#с помощью рекурсии.

def extent(a, b):
    if b == 0:
        return 1
    elif b == 1:
        return a
    else:
        return a * extent(a, b-1)

a, b = map(int, input('Введите два числа через пробел: ').split())
print('Результат a в степени b -->', extent(a, b))
