#Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с
#повторениями). Выдать без повторений в порядке возрастания все те числа, которые
#встречаются в обоих наборах.
#Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во
#элементов второго множества. Затем пользователь вводит сами элементы множеств.
#11 6
#2 4 6 8 10 12 10 8 6 4 2
#3 6 9 12 15 18
#6 12

n, m = map(int, input('Задайте количество элементов обоих множеств через пробел: ').split())
a = set()
for i in range(n):
    if i < n:
        a.add(input(f'Введите элемент {i + 1} первого множества: '))
b = set()
for i in range(n):
    if i < m:
        b.add(input(f'Введите элемент {i + 1} второго множества: '))

print('Результат пересечения множеств: ', a.intersection(b))




