#Задача 34: Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку
#разобраться в его кричалках не настолько просто, насколько легко он их придумывает, Вам
#стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число
#гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного
#слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг
#от друга пробелами. Стихотворение Винни-Пух вбивает в программу с клавиатуры. В ответе
#напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не
#в порядке.


vowel = {1: {'а', 'о', 'и', 'е', 'ё', 'э', 'ы', 'у', 'ю', 'я'}}
text = input('Введите стихотворение: ')
res = map(str, text)
print('Парам пам-пам - ритм есть' if sum([k for i in res for k, v in vowel.items() if i in v]) % 2 == 0 else 'Пам парам - над ритмом нужно поработать') 
#Проверка: 
#Парам пам-пам па-па-рам - ритм не тот           (7 гласных, делится на 2 с остатком)
#Парам пам-пам парам-пам-пам - ритм что надо     (8 гласных, делится на 2 без остатка) 