#Заполните массив элементами арифметической прогрессии. 
#Ее первый элемент, разность и количество элементов нужно ввести с клавиатуры.
#Формула для получения n-го члена прогрессии: 
#an = a1 + (n-1) * d.
#Каждое число вводится с новой строки.
#Ввод: 7 2 5
#Вывод: 7 9 11 13 15

a1 = int(input('Введите первый элемент: '))
d = int(input('Введите разность арифметической прогрессии: '))
n = int(input('Введите количество элементов: '))

arith_progression_massive = []
for i in range(n):
    arith_progression_massive.append(a1 + i * d)
print(*arith_progression_massive)