# Задача 18: Требуется найти в массиве A[1..N] самый близкий по
# величине элемент к заданному числу X. Пользователь в первой строке
# вводит натуральное число N – количество элементов в массиве. В
# последующих строках записаны N целых чисел A. Последняя строка
# содержит число X.
# 5
# 1 2 3 4 5
# 6
# -> 5

import random

n = int(input('Введите количество элементов в списке: '))     # 5
x = int(input('x = '))

list = []
for i in range(n):
    list.append(random.randint(1, 7))
print(list)
new_list = list.copy()
print(sorted(new_list))

res = []
for num, i in enumerate(new_list):                    # ф-ция enumerate() позволяет получить сразу индекс элемента и его значение
    if i >= x:
        if x - new_list[num - 1] > new_list[num] - x:
            res.append(new_list[num])
        else: 
            res.append(new_list[num - 1])
if res:
    print('Близкое по величине число к заданному x -->', res[0])         # исходя из первого наибольшего числа (найденного по списку),
else:                                                                    # находим соседей x и сравниваем их на близость к нему;
    print('Близкое по величине число к заданному x -->', max(new_list))  # => выводим первое число или максимальное в списке          


